tutorials/incompressible/simpleSolver/ras/motorBike/0.org/include/frontBackUpperPatches
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

upperWall
{
    type slip;
}

frontAndBack
{
    type slip;
}

// ************************************************************************* //
