tutorials/incompressible/simpleSolver/ras/motorBike/0.org/omega
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    lowerWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    "motorBike_.*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
