tutorials/incompressible/simpleSolver/ras/motorBike/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

72
(
    frontAndBack
    {
        type            patch;
        nFaces          320;
        startFace       1028566;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       1028886;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       1028950;
    }
    lowerWall
    {
        type            wall;
        nFaces          5330;
        startFace       1029014;
    }
    upperWall
    {
        type            patch;
        nFaces          160;
        startFace       1034344;
    }
    motorBike_frt-fairing:001%1
    {
        type            wall;
        nFaces          5419;
        startFace       1034504;
    }
    motorBike_windshield:002%2
    {
        type            wall;
        nFaces          50;
        startFace       1039923;
    }
    motorBike_rr-wh-rim:005%5
    {
        type            wall;
        nFaces          141;
        startFace       1039973;
    }
    motorBike_rr-wh-rim:010%10
    {
        type            wall;
        nFaces          340;
        startFace       1040114;
    }
    motorBike_fr-wh-rim:011%11
    {
        type            wall;
        nFaces          473;
        startFace       1040454;
    }
    motorBike_fr-wh-brake-disk:012%12
    {
        type            wall;
        nFaces          54;
        startFace       1040927;
    }
    motorBike_frame:016-shadow%13
    {
        type            wall;
        nFaces          105;
        startFace       1040981;
    }
    motorBike_rear-susp:014%14
    {
        type            wall;
        nFaces          823;
        startFace       1041086;
    }
    motorBike_rear-susp:014-shadow%15
    {
        type            wall;
        nFaces          479;
        startFace       1041909;
    }
    motorBike_frame:016%16
    {
        type            wall;
        nFaces          55;
        startFace       1042388;
    }
    motorBike_rr-wh-rim:005-shadow%17
    {
        type            wall;
        nFaces          67;
        startFace       1042443;
    }
    motorBike_rr-wh-chain-hub:022%22
    {
        type            wall;
        nFaces          141;
        startFace       1042510;
    }
    motorBike_rearseat%24
    {
        type            wall;
        nFaces          430;
        startFace       1042651;
    }
    motorBike_frt-fairing%25
    {
        type            wall;
        nFaces          626;
        startFace       1043081;
    }
    motorBike_windshield%26
    {
        type            wall;
        nFaces          377;
        startFace       1043707;
    }
    motorBike_headlights%27
    {
        type            wall;
        nFaces          161;
        startFace       1044084;
    }
    motorBike_driversseat%28
    {
        type            wall;
        nFaces          368;
        startFace       1044245;
    }
    motorBike_rear-body%29
    {
        type            wall;
        nFaces          2077;
        startFace       1044613;
    }
    motorBike_fuel-tank%30
    {
        type            wall;
        nFaces          912;
        startFace       1046690;
    }
    motorBike_exhaust%31
    {
        type            wall;
        nFaces          2392;
        startFace       1047602;
    }
    motorBike_rr-wh-rim%32
    {
        type            wall;
        nFaces          1430;
        startFace       1049994;
    }
    motorBike_fr-mud-guard%33
    {
        type            wall;
        nFaces          638;
        startFace       1051424;
    }
    motorBike_fr-wh-rim%34
    {
        type            wall;
        nFaces          591;
        startFace       1052062;
    }
    motorBike_fr-wh-brake-disk%35
    {
        type            wall;
        nFaces          442;
        startFace       1052653;
    }
    motorBike_fr-brake-caliper%36
    {
        type            wall;
        nFaces          164;
        startFace       1053095;
    }
    motorBike_fr-wh-tyre%37
    {
        type            wall;
        nFaces          1116;
        startFace       1053259;
    }
    motorBike_hbars%38
    {
        type            wall;
        nFaces          535;
        startFace       1054375;
    }
    motorBike_fr-forks%39
    {
        type            wall;
        nFaces          1140;
        startFace       1054910;
    }
    motorBike_chain%40
    {
        type            wall;
        nFaces          474;
        startFace       1056050;
    }
    motorBike_rr-wh-tyre%41
    {
        type            wall;
        nFaces          1787;
        startFace       1056524;
    }
    motorBike_square-dial%42
    {
        type            wall;
        nFaces          6;
        startFace       1058311;
    }
    motorBike_round-dial%43
    {
        type            wall;
        nFaces          17;
        startFace       1058317;
    }
    motorBike_dial-holder%44
    {
        type            wall;
        nFaces          87;
        startFace       1058334;
    }
    motorBike_rear-susp%45
    {
        type            wall;
        nFaces          1786;
        startFace       1058421;
    }
    motorBike_rear-brake-lights%46
    {
        type            wall;
        nFaces          53;
        startFace       1060207;
    }
    motorBike_rear-light-bracket%47
    {
        type            wall;
        nFaces          163;
        startFace       1060260;
    }
    motorBike_frame%48
    {
        type            wall;
        nFaces          2040;
        startFace       1060423;
    }
    motorBike_rear-mud-guard%49
    {
        type            wall;
        nFaces          641;
        startFace       1062463;
    }
    motorBike_rear-susp-spring-damp%50
    {
        type            wall;
        nFaces          106;
        startFace       1063104;
    }
    motorBike_fairing-inner-plate%51
    {
        type            wall;
        nFaces          445;
        startFace       1063210;
    }
    motorBike_clutch-housing%52
    {
        type            wall;
        nFaces          970;
        startFace       1063655;
    }
    motorBike_radiator%53
    {
        type            wall;
        nFaces          42;
        startFace       1064625;
    }
    motorBike_water-pipe%54
    {
        type            wall;
        nFaces          104;
        startFace       1064667;
    }
    motorBike_water-pump%55
    {
        type            wall;
        nFaces          74;
        startFace       1064771;
    }
    motorBike_engine%56
    {
        type            wall;
        nFaces          2389;
        startFace       1064845;
    }
    motorBike_rear-shock-link%57
    {
        type            wall;
        nFaces          26;
        startFace       1067234;
    }
    motorBike_rear-brake-fluid-pot-bracket%58
    {
        type            wall;
        nFaces          39;
        startFace       1067260;
    }
    motorBike_rear-brake-fluid-pot%59
    {
        type            wall;
        nFaces          53;
        startFace       1067299;
    }
    motorBike_footpeg%60
    {
        type            wall;
        nFaces          86;
        startFace       1067352;
    }
    motorBike_rr-wh-chain-hub%61
    {
        type            wall;
        nFaces          114;
        startFace       1067438;
    }
    motorBike_rear-brake-caliper%62
    {
        type            wall;
        nFaces          142;
        startFace       1067552;
    }
    motorBike_rider-helmet%65
    {
        type            wall;
        nFaces          583;
        startFace       1067694;
    }
    motorBike_rider-visor%66
    {
        type            wall;
        nFaces          95;
        startFace       1068277;
    }
    motorBike_rider-boots%67
    {
        type            wall;
        nFaces          1025;
        startFace       1068372;
    }
    motorBike_rider-gloves%68
    {
        type            wall;
        nFaces          319;
        startFace       1069397;
    }
    motorBike_rider-body%69
    {
        type            wall;
        nFaces          4555;
        startFace       1069716;
    }
    motorBike_frame:0%70
    {
        type            wall;
        nFaces          37;
        startFace       1074271;
    }
    motorBike_frt-fairing:001-shadow%74
    {
        type            wall;
        nFaces          3349;
        startFace       1074308;
    }
    motorBike_windshield-shadow%75
    {
        type            wall;
        nFaces          259;
        startFace       1077657;
    }
    motorBike_fr-mud-guard-shadow%81
    {
        type            wall;
        nFaces          353;
        startFace       1077916;
    }
    motorBike_fr-wh-brake-disk-shadow%83
    {
        type            wall;
        nFaces          173;
        startFace       1078269;
    }
    motorBike_rear-mud-guard-shadow%84
    {
        type            wall;
        nFaces          408;
        startFace       1078442;
    }
    motorBike_rear-susp-spring-damp-shadow%85
    {
        type            wall;
        nFaces          43;
        startFace       1078850;
    }
    motorBike_radiator-shadow%86
    {
        type            wall;
        nFaces          18;
        startFace       1078893;
    }
    motorBike_rear-shock-link-shadow%87
    {
        type            wall;
        nFaces          7;
        startFace       1078911;
    }
    motorBike_rear-brake-fluid-pot-bracket-shadow%88
    {
        type            wall;
        nFaces          27;
        startFace       1078918;
    }
    motorBike_rr-wh-chain-hub-shadow%89
    {
        type            wall;
        nFaces          57;
        startFace       1078945;
    }
)

// ************************************************************************* //
