tutorials/incompressible/simpleSolver/ras/motorBike/system/decomposeParDict
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

method       scotch;

simpleCoeffs
{
    n               (4 1 1);
    delta           0.001;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}


// ************************************************************************* //
