tutorials/incompressible/simpleSolver/ras/motorBike/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
        solver          PCG;
        preconditioner  SSGS;
        preconditioner
        {
            preconditioner  GAMG;
            smoother        SSGS;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-12;
        relTol          0.01;
    }
    
    "(U|k|omega)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-12;
        relTol           0.1;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    pRefCell            0;
    pRefValue           0;
    consistent          1;
    correctionForm      1;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.3;
        pCorr           0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
