tutorials/incompressible/simpleSolver/ras/motorBike/system/streamLines
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

streamLines
{
    type            streamLine;

    // Output every
    outputControl   outputTime;
    // outputInterval 10;

    setFormat       vtk; //gnuplot; //xmgr; //raw; //jplot;

    // Velocity field to use for tracking.
    UName U;

    // Tracked forwards (+U) or backwards (-U)
    trackForward    true;

    // Names of fields to sample. Should contain above velocity field!
    fields (p U k);

    // Steps particles can travel before being removed
    lifeTime        10000;

    // Number of steps per cell (estimate). Set to 1 to disable subcycling.
    nSubCycle 5;

    // Cloud name to use
    cloudName       particleTracks;

    // Seeding method. See the sampleSets in sampleDict.
    seedSampleSet   uniform;  //cloud;//triSurfaceMeshPointSet;

    uniformCoeffs
    {
        type        uniform;
        axis        x;  //distance;

        // Note: tracks slightly offset so as not to be on a face
        start       (-1.001 1e-7 0.0011);
        end         (-1.001 1e-7 1.0011);
        nPoints     20;
    }
}


// ************************************************************************* //
